import { Award, Users, Building2, Star } from 'lucide-react';

export const stats = [
  { icon: Award, value: '20+', label: 'שנות ניסיון' },
  { icon: Users, value: '1000+', label: 'לקוחות מרוצים' },
  { icon: Building2, value: '500M+', label: 'שווי עסקאות' },
  { icon: Star, value: '98%', label: 'שביעות רצון' }
];

export const owners = [
  {
    id: 1,
    name: 'רם',
    title: 'מייסד ומתווך נדל"ן',
    image: '/images/owner1.jpg',
    phone: '*8851',
    email: 'ram@example.com',
    description: 'רם הוא מתווך נדל"ן בעל ניסיון של 27 שנים המתמחה בשיווק דירות למכירה בחולון, בת-ים וראשון-לציון. הוא ידוע בגישה הישירה, ביכולת להבין במהירות את צרכי הלקוח ובניהול משא ומתן מדויק שמוביל לתוצאות.'
  },
  {
    id: 2,
    name: 'חיים ענבי',
    title: 'מייסד ומתווך נדל"ן',
    image: '/images/owner2.jpg',
    phone: '*8851',
    email: 'haim@example.com',
    description: 'חיים מביא ניסיון רב שמגיע עם 10 שנות תעסוקה בתחום התיווך והשיווק, עם הכרות מעמיקה של שכונות חולון, תל-אביב והסביבה. חיים מתמקד בליווי אישי, זמינות גבוהה ושירות מקצועי לכל לקוח.'
  }
];

export const team = [
  {
    id: 1,
    name: 'תומר',
    role: 'סוכן נדל״ן',
    image: '/agent-second.jpg',
    phone: '09-7407500',
    mobile: '052-7808233',
    fax: '09-7407600',
    email: 'lior@example.com',
    description: " תומר הוא סוכן נדל״ן בכיר בעל 19 שנות ניסיון, המתמחה באיזור חולון ובת-ים, עם היכרות עמוקה של השכונות והקונים המקומיים. משלב תמחור מדויק, שיווק חכם וניהול מו״מ חד כדי להביא לעסקה מהירה ובתנאים הטובים ביותר"
  },
  {
    id: 2,
    name: 'ליאור',
    role: 'סוכנת נדל״ן',
    image: '/agent-fisrt.jpg',
    phone: '09-7407500',
    mobile: '052-3385053',
    fax: '09-7407600',
    email: 'tamar@example.com',
    description: "סוכנת נדל״ן מנוסה הפועלת מזה מספר שנים באזור חולון ובת-ים, עם היכרות מעמיקה של השכונות, מחירי השוק וקהל הקונים המקומי. מתמחה בליווי מוכרים ורוכשים משלב התמחור והבדיקות ועד סגירת העסקה, תוך התאמה אישית לצרכים ולמטרות הלקוח. משלבת שיווק מדויק, ניהול משא ומתן מקצועי וזמינות מלאה כדי להגיע לתוצאה בטוחה ובתנאים הטובים ביותר"
  }
];

export type Owner = typeof owners[0];
export type TeamMember = typeof team[0];
